package lambdas.poetry;

import java.util.List;

import static java.util.Arrays.asList;

public class Poetry {
    public static void main(String[] args) {
        PoetryUtil poetryUtil = new PoetryUtil();
        List<String> listOfPoetry = asList(
                "Я волком бы\n" +
                        " выгрыз\n" +
                        " бюрократизм.",
                "К мандатам\n" +
                        " почтения нету.",
                "К любым\n" +
                        " чертям с матерями\n" +
                        " катись",
                "любая бумажка.\n" +
                        " Но эту…",
                "По длинному фронту\n" +
                        " купе\n" +
                        " и кают",
                "чиновник\n" +
                        " учтивый\n" +
                        " движется.",
                "Сдают паспорта,\n" +
                        " и я\n" +
                        " сдаю",
                "мою\n" +
                        " пурпурную книжицу.",
                "К одним паспортам —\n" +
                        " улыбка у рта.",
                "К другим —\n" +
                        " отношение плевое.",
                "С почтеньем\n" +
                        " берут, например,\n" +
                        " паспорта",
                "с двухспальным\n" +
                        "английским левою.",
                "Глазами\n" +
                        " доброго дядю выев,",
                "не переставая\n" +
                        " кланяться,",
                "берут,\n" +
                        " как будто берут чаевые,",
                "паспорт\n" +
                        " американца.",
                "На польский —\n" +
                        " глядят,\n" +
                        " как в афишу коза.",
                "На польский —\n" +
                        " выпяливают глаза",
                "в тугой\n" +
                        " полицейской слоновости —",
                "откуда, мол,\n" +
                        " и что это за",
                "географические новости?",
                "И не повернув\n" +
                        " головы качан",
                "и чувств\n" +
                        " никаких\n" +
                        " не изведав,",
                "берут,\n" +
                        " не моргнув,\n" +
                        " паспорта датчан",
                "и разных\n" +
                        " прочих\n" +
                        " шведов,",
                "И вдруг,\n" +
                        " как будто\n" +
                        " ожогом,\n" +
                        " рот",
                "скривило\n" +
                        " господину.",
                "Это\n" +
                        " господин чиновник\n" +
                        " берет",
                "мою\n" +
                        " краснокожую паспортину.",
                "Берет —\n" +
                        " как бомбу,\n" +
                        " берет —\n" +
                        " как ежа,",
                "как бритву\n" +
                        " обоюдоострую,",
                "берет,\n" +
                        " как гремучую\n" +
                        " в 20 жал",
                "змею\n" +
                        " двухметроворостую.",
                "Моргнул\n" +
                        " многозначаще\n" +
                        " глаз носильщика,",
                "хоть вещи\n" +
                        " снесет задаром вам.",
                "Жандарм\n" +
                        " вопросительно\n" +
                        " смотрит на сыщика,",
                "сыщик\n" +
                        " на жандарма.",
                "С каким наслажденьем\n" +
                        " жандармской кастой",
                "я был бы\n" +
                        " исхлестан и распят",
                "за то,\n" +
                        " что в руках у меня\n" +
                        " молоткастый,",
                "серпастый\n" +
                        " советский паспорт.",
                "Я волком бы\n" +
                        " выгрыз\n" +
                        " бюрократизм.",
                "К мандатам\n" +
                        " почтения нету.",
                "К любым\n" +
                        " чертям с матерями\n" +
                        " катись",
                "любая бумажка.\n" +
                        " Но эту…",
                "Я\n" +
                        " достаю\n" +
                        " из широких штанин",
                "дубликатом\n" +
                        " бесценного груза.",
                "Читайте,\n" +
                        " завидуйте,\n" +
                        " я —\n" +
                        " гражданин",
                "Советского Союза.");

        poetryUtil.showStatistics(listOfPoetry);
    }
}
